Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls60_rd/pic32cm_ls60_rd_smart_lock/firmware/Secure/firmware/src/packs/PIC32CM5164LS60064_DFP/component/evsys.h
#define EVSYS_READYUSR_READYUSR_Pos           _UINT32_(0)                                          /* (EVSYS_READYUSR Position) Ready User for Channel 7 */
#define EVSYS_READYUSR_READYUSR_Msk           (_UINT32_(0xFF) << EVSYS_READYUSR_READYUSR_Pos)      /* (EVSYS_READYUSR Mask) READYUSR */
#define EVSYS_READYUSR_READYUSR(value)        (EVSYS_READYUSR_READYUSR_Msk & (_UINT32_(value) << EVSYS_READYUSR_READYUSR_Pos)) 

/* -------- EVSYS_USER : (EVSYS Offset: 0x120) (R/W 8) User Multiplexer n -------- */
#define EVSYS_USER_RESETVALUE                 _UINT8_(0x00)                                        /*  (EVSYS_USER) User Multiplexer n  Reset Value */

#define EVSYS_USER_CHANNEL_Pos                _UINT8_(0)                                           /* (EVSYS_USER) Channel Event Selection Position */
#define EVSYS_USER_CHANNEL_Msk                (_UINT8_(0xF) << EVSYS_USER_CHANNEL_Pos)             /* (EVSYS_USER) Channel Event Selection Mask */
#define EVSYS_USER_CHANNEL(value)             (EVSYS_USER_CHANNEL_Msk & (_UINT8_(value) << EVSYS_USER_CHANNEL_Pos)) /* Assigment of value for CHANNEL in the EVSYS_USER register */
#define EVSYS_USER_Msk                        _UINT8_(0x0F)                                        /* (EVSYS_USER) Register Mask  */


/* -------- EVSYS_INTENCLR : (EVSYS Offset: 0x1D4) (R/W 8) Interrupt Enable Clear -------- */
#define EVSYS_INTENCLR_RESETVALUE             _UINT8_(0x00)                                        /*  (EVSYS_INTENCLR) Interrupt Enable Clear  Reset Value */

#define EVSYS_INTENCLR_NSCHK_Pos              _UINT8_(0)                                           /* (EVSYS_INTENCLR) Non-Secure Check Interrupt Enable Position */
#define EVSYS_INTENCLR_NSCHK_Msk              (_UINT8_(0x1) << EVSYS_INTENCLR_NSCHK_Pos)           /* (EVSYS_INTENCLR) Non-Secure Check Interrupt Enable Mask */
#define EVSYS_INTENCLR_NSCHK(value)           (EVSYS_INTENCLR_NSCHK_Msk & (_UINT8_(value) << EVSYS_INTENCLR_NSCHK_Pos)) /* Assigment of value for NSCHK in the EVSYS_INTENCLR register */
#define EVSYS_INTENCLR_Msk                    _UINT8_(0x01)                                        /* (EVSYS_INTENCLR) Register Mask  */


/* -------- EVSYS_INTENSET : (EVSYS Offset: 0x1D5) (R/W 8) Interrupt Enable Set -------- */
#define EVSYS_INTENSET_RESETVALUE             _UINT8_(0x00)                                        /*  (EVSYS_INTENSET) Interrupt Enable Set  Reset Value */

#define EVSYS_INTENSET_NSCHK_Pos              _UINT8_(0)                                           /* (EVSYS_INTENSET) Non-Secure Check Interrupt Enable Position */
#define EVSYS_INTENSET_NSCHK_Msk              (_UINT8_(0x1) << EVSYS_INTENSET_NSCHK_Pos)           /* (EVSYS_INTENSET) Non-Secure Check Interrupt Enable Mask */
#define EVSYS_INTENSET_NSCHK(value)           (EVSYS_INTENSET_NSCHK_Msk & (_UINT8_(value) << EVSYS_INTENSET_NSCHK_Pos)) /* Assigment of value for NSCHK in the EVSYS_INTENSET register */
#define EVSYS_INTENSET_Msk                    _UINT8_(0x01)                                        /* (EVSYS_INTENSET) Register Mask  */


/* -------- EVSYS_INTFLAG : (EVSYS Offset: 0x1D6) (R/W 8) Interrupt Flag Status and Clear -------- */
#define EVSYS_INTFLAG_RESETVALUE              _UINT8_(0x00)                                        /*  (EVSYS_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define EVSYS_INTFLAG_NSCHK_Pos               _UINT8_(0)                                           /* (EVSYS_INTFLAG) Non-Secure Check Position */
#define EVSYS_INTFLAG_NSCHK_Msk               (_UINT8_(0x1) << EVSYS_INTFLAG_NSCHK_Pos)            /* (EVSYS_INTFLAG) Non-Secure Check Mask */
#define EVSYS_INTFLAG_NSCHK(value)            (EVSYS_INTFLAG_NSCHK_Msk & (_UINT8_(value) << EVSYS_INTFLAG_NSCHK_Pos)) /* Assigment of value for NSCHK in the EVSYS_INTFLAG register */
#define EVSYS_INTFLAG_Msk                     _UINT8_(0x01)                                        /* (EVSYS_INTFLAG) Register Mask  */


/* -------- EVSYS_NONSECCHAN : (EVSYS Offset: 0x1D8) (R/W 32) Channels Security Attribution -------- */
#define EVSYS_NONSECCHAN_RESETVALUE           _UINT32_(0x00)                                       /*  (EVSYS_NONSECCHAN) Channels Security Attribution  Reset Value */

#define EVSYS_NONSECCHAN_CHANNEL0_Pos         _UINT32_(0)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 0 Position */
#define EVSYS_NONSECCHAN_CHANNEL0_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL0_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 0 Mask */
#define EVSYS_NONSECCHAN_CHANNEL0(value)      (EVSYS_NONSECCHAN_CHANNEL0_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL0_Pos)) /* Assigment of value for CHANNEL0 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL1_Pos         _UINT32_(1)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 1 Position */
#define EVSYS_NONSECCHAN_CHANNEL1_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL1_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 1 Mask */
#define EVSYS_NONSECCHAN_CHANNEL1(value)      (EVSYS_NONSECCHAN_CHANNEL1_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL1_Pos)) /* Assigment of value for CHANNEL1 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL2_Pos         _UINT32_(2)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 2 Position */
#define EVSYS_NONSECCHAN_CHANNEL2_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL2_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 2 Mask */
#define EVSYS_NONSECCHAN_CHANNEL2(value)      (EVSYS_NONSECCHAN_CHANNEL2_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL2_Pos)) /* Assigment of value for CHANNEL2 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL3_Pos         _UINT32_(3)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 3 Position */
#define EVSYS_NONSECCHAN_CHANNEL3_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL3_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 3 Mask */
#define EVSYS_NONSECCHAN_CHANNEL3(value)      (EVSYS_NONSECCHAN_CHANNEL3_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL3_Pos)) /* Assigment of value for CHANNEL3 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL4_Pos         _UINT32_(4)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 4 Position */
#define EVSYS_NONSECCHAN_CHANNEL4_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL4_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 4 Mask */
#define EVSYS_NONSECCHAN_CHANNEL4(value)      (EVSYS_NONSECCHAN_CHANNEL4_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL4_Pos)) /* Assigment of value for CHANNEL4 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL5_Pos         _UINT32_(5)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 5 Position */
#define EVSYS_NONSECCHAN_CHANNEL5_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL5_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 5 Mask */
#define EVSYS_NONSECCHAN_CHANNEL5(value)      (EVSYS_NONSECCHAN_CHANNEL5_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL5_Pos)) /* Assigment of value for CHANNEL5 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL6_Pos         _UINT32_(6)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 6 Position */
#define EVSYS_NONSECCHAN_CHANNEL6_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL6_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 6 Mask */
#define EVSYS_NONSECCHAN_CHANNEL6(value)      (EVSYS_NONSECCHAN_CHANNEL6_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL6_Pos)) /* Assigment of value for CHANNEL6 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL7_Pos         _UINT32_(7)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 7 Position */
#define EVSYS_NONSECCHAN_CHANNEL7_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL7_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 7 Mask */
#define EVSYS_NONSECCHAN_CHANNEL7(value)      (EVSYS_NONSECCHAN_CHANNEL7_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL7_Pos)) /* Assigment of value for CHANNEL7 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL8_Pos         _UINT32_(8)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 8 Position */
#define EVSYS_NONSECCHAN_CHANNEL8_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL8_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 8 Mask */
#define EVSYS_NONSECCHAN_CHANNEL8(value)      (EVSYS_NONSECCHAN_CHANNEL8_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL8_Pos)) /* Assigment of value for CHANNEL8 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL9_Pos         _UINT32_(9)                                          /* (EVSYS_NONSECCHAN) Non-Secure for Channel 9 Position */
#define EVSYS_NONSECCHAN_CHANNEL9_Msk         (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL9_Pos)     /* (EVSYS_NONSECCHAN) Non-Secure for Channel 9 Mask */
#define EVSYS_NONSECCHAN_CHANNEL9(value)      (EVSYS_NONSECCHAN_CHANNEL9_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL9_Pos)) /* Assigment of value for CHANNEL9 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL10_Pos        _UINT32_(10)                                         /* (EVSYS_NONSECCHAN) Non-Secure for Channel 10 Position */
#define EVSYS_NONSECCHAN_CHANNEL10_Msk        (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL10_Pos)    /* (EVSYS_NONSECCHAN) Non-Secure for Channel 10 Mask */
#define EVSYS_NONSECCHAN_CHANNEL10(value)     (EVSYS_NONSECCHAN_CHANNEL10_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL10_Pos)) /* Assigment of value for CHANNEL10 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_CHANNEL11_Pos        _UINT32_(11)                                         /* (EVSYS_NONSECCHAN) Non-Secure for Channel 11 Position */
#define EVSYS_NONSECCHAN_CHANNEL11_Msk        (_UINT32_(0x1) << EVSYS_NONSECCHAN_CHANNEL11_Pos)    /* (EVSYS_NONSECCHAN) Non-Secure for Channel 11 Mask */
#define EVSYS_NONSECCHAN_CHANNEL11(value)     (EVSYS_NONSECCHAN_CHANNEL11_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL11_Pos)) /* Assigment of value for CHANNEL11 in the EVSYS_NONSECCHAN register */
#define EVSYS_NONSECCHAN_Msk                  _UINT32_(0x00000FFF)                                 /* (EVSYS_NONSECCHAN) Register Mask  */

#define EVSYS_NONSECCHAN_CHANNEL_Pos          _UINT32_(0)                                          /* (EVSYS_NONSECCHAN Position) Non-Secure for Channel xx */
#define EVSYS_NONSECCHAN_CHANNEL_Msk          (_UINT32_(0xFFF) << EVSYS_NONSECCHAN_CHANNEL_Pos)    /* (EVSYS_NONSECCHAN Mask) CHANNEL */
#define EVSYS_NONSECCHAN_CHANNEL(value)       (EVSYS_NONSECCHAN_CHANNEL_Msk & (_UINT32_(value) << EVSYS_NONSECCHAN_CHANNEL_Pos)) 

/* -------- EVSYS_NSCHKCHAN : (EVSYS Offset: 0x1DC) (R/W 32) Non-Secure Channels Check -------- */
#define EVSYS_NSCHKCHAN_RESETVALUE            _UINT32_(0x00)                                       /*  (EVSYS_NSCHKCHAN) Non-Secure Channels Check  Reset Value */

#define EVSYS_NSCHKCHAN_CHANNEL0_Pos          _UINT32_(0)                                          /* (EVSYS_NSCHKCHAN) Channel 0 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL0_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL0_Pos)      /* (EVSYS_NSCHKCHAN) Channel 0 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL0(value)       (EVSYS_NSCHKCHAN_CHANNEL0_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL0_Pos)) /* Assigment of value for CHANNEL0 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL1_Pos          _UINT32_(1)                                          /* (EVSYS_NSCHKCHAN) Channel 1 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL1_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL1_Pos)      /* (EVSYS_NSCHKCHAN) Channel 1 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL1(value)       (EVSYS_NSCHKCHAN_CHANNEL1_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL1_Pos)) /* Assigment of value for CHANNEL1 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL2_Pos          _UINT32_(2)                                          /* (EVSYS_NSCHKCHAN) Channel 2 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL2_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL2_Pos)      /* (EVSYS_NSCHKCHAN) Channel 2 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL2(value)       (EVSYS_NSCHKCHAN_CHANNEL2_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL2_Pos)) /* Assigment of value for CHANNEL2 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL3_Pos          _UINT32_(3)                                          /* (EVSYS_NSCHKCHAN) Channel 3 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL3_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL3_Pos)      /* (EVSYS_NSCHKCHAN) Channel 3 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL3(value)       (EVSYS_NSCHKCHAN_CHANNEL3_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL3_Pos)) /* Assigment of value for CHANNEL3 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL4_Pos          _UINT32_(4)                                          /* (EVSYS_NSCHKCHAN) Channel 4 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL4_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL4_Pos)      /* (EVSYS_NSCHKCHAN) Channel 4 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL4(value)       (EVSYS_NSCHKCHAN_CHANNEL4_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL4_Pos)) /* Assigment of value for CHANNEL4 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL5_Pos          _UINT32_(5)                                          /* (EVSYS_NSCHKCHAN) Channel 5 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL5_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL5_Pos)      /* (EVSYS_NSCHKCHAN) Channel 5 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL5(value)       (EVSYS_NSCHKCHAN_CHANNEL5_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL5_Pos)) /* Assigment of value for CHANNEL5 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL6_Pos          _UINT32_(6)                                          /* (EVSYS_NSCHKCHAN) Channel 6 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL6_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL6_Pos)      /* (EVSYS_NSCHKCHAN) Channel 6 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL6(value)       (EVSYS_NSCHKCHAN_CHANNEL6_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL6_Pos)) /* Assigment of value for CHANNEL6 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL7_Pos          _UINT32_(7)                                          /* (EVSYS_NSCHKCHAN) Channel 7 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL7_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL7_Pos)      /* (EVSYS_NSCHKCHAN) Channel 7 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL7(value)       (EVSYS_NSCHKCHAN_CHANNEL7_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL7_Pos)) /* Assigment of value for CHANNEL7 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL8_Pos          _UINT32_(8)                                          /* (EVSYS_NSCHKCHAN) Channel 8 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL8_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL8_Pos)      /* (EVSYS_NSCHKCHAN) Channel 8 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL8(value)       (EVSYS_NSCHKCHAN_CHANNEL8_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL8_Pos)) /* Assigment of value for CHANNEL8 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL9_Pos          _UINT32_(9)                                          /* (EVSYS_NSCHKCHAN) Channel 9 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL9_Msk          (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL9_Pos)      /* (EVSYS_NSCHKCHAN) Channel 9 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL9(value)       (EVSYS_NSCHKCHAN_CHANNEL9_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL9_Pos)) /* Assigment of value for CHANNEL9 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL10_Pos         _UINT32_(10)                                         /* (EVSYS_NSCHKCHAN) Channel 10 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL10_Msk         (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL10_Pos)     /* (EVSYS_NSCHKCHAN) Channel 10 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL10(value)      (EVSYS_NSCHKCHAN_CHANNEL10_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL10_Pos)) /* Assigment of value for CHANNEL10 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_CHANNEL11_Pos         _UINT32_(11)                                         /* (EVSYS_NSCHKCHAN) Channel 11 to be checked as non-secured Position */
#define EVSYS_NSCHKCHAN_CHANNEL11_Msk         (_UINT32_(0x1) << EVSYS_NSCHKCHAN_CHANNEL11_Pos)     /* (EVSYS_NSCHKCHAN) Channel 11 to be checked as non-secured Mask */
#define EVSYS_NSCHKCHAN_CHANNEL11(value)      (EVSYS_NSCHKCHAN_CHANNEL11_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL11_Pos)) /* Assigment of value for CHANNEL11 in the EVSYS_NSCHKCHAN register */
#define EVSYS_NSCHKCHAN_Msk                   _UINT32_(0x00000FFF)                                 /* (EVSYS_NSCHKCHAN) Register Mask  */

#define EVSYS_NSCHKCHAN_CHANNEL_Pos           _UINT32_(0)                                          /* (EVSYS_NSCHKCHAN Position) Channel xx to be checked as non-secured */
#define EVSYS_NSCHKCHAN_CHANNEL_Msk           (_UINT32_(0xFFF) << EVSYS_NSCHKCHAN_CHANNEL_Pos)     /* (EVSYS_NSCHKCHAN Mask) CHANNEL */
#define EVSYS_NSCHKCHAN_CHANNEL(value)        (EVSYS_NSCHKCHAN_CHANNEL_Msk & (_UINT32_(value) << EVSYS_NSCHKCHAN_CHANNEL_Pos)) 

/* -------- EVSYS_NONSECUSER0 : (EVSYS Offset: 0x1E0) (R/W 32) Users Security Attribution -------- */
#define EVSYS_NONSECUSER0_RESETVALUE          _UINT32_(0x00)                                       /*  (EVSYS_NONSECUSER0) Users Security Attribution  Reset Value */

